test/resources/base-payment-intent-created.json

{
  "id": "pi_1FRchnCFQq9RQBv8kY2w1XHF",
  "object": "payment_intent",
  "allowed_source_types": [
    "card"
  ],
  "amount": 13700,
  "amount_capturable": 0,
  "amount_received": 0,
  "application": null,
  "application_fee_amount": null,
  "canceled_at": null,
  "cancellation_reason": null,
  "capture_method": "automatic",
  "charges": {
    "object": "list",
    "data": [],
    "has_more": false,
    "total_count": 0,
    "url": "/v1/charges?payment_intent=pi_1FRchnCFQq9RQBv8kY2w1XHF"
  },
  "client_secret": "pi_1FRchnCFQq9RQBv8kY2w1XHF_secret_khpNYERfG0ukjTfjtqDs7o4o3",
  "confirmation_method": "automatic",
  "created": 1570618063,
  "currency": "eur",
  "customer": null,
  "description": "Charge for brad.pitt@alvarcarto.com",
  "invoice": null,
  "last_payment_error": null,
  "livemode": false,
  "metadata": {

  },
  "next_action": null,
  "next_source_action": null,
  "on_behalf_of": null,
  "payment_method": null,
  "payment_method_options": {
    "card": {
      "installments": null,
      "request_three_d_secure": "automatic"
    }
  },
  "payment_method_types": [
    "card"
  ],
  "receipt_email": null,
  "review": null,
  "setup_future_usage": null,
  "shipping": null,
  "source": null,
  "statement_descriptor": "alvarcarto.com",
  "statement_descriptor_suffix": null,
  "status": "requires_source",
  "transfer_data": null,
  "transfer_group": null
}